{
  "backend/main.mo": "Motoko canister storing brand and creator submissions with functions to submit, query by email, and fetch all submissions.",
  "feature_evidence.json": "Feature evidence report listing implemented marketing features, their files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend marketing component and utility file.",
  "frontend/index.css": "Tailwind CSS base setup defining color tokens, dark mode variables, and global styling rules.",
  "frontend/index.html": "Basic HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main app layout composing header, hero, marketing sections, lead capture, contact section, and footer.",
  "frontend/src/components/marketing/ContactSection.tsx": "Contact section with email and WhatsApp actions plus response‑time and working‑hours cards.",
  "frontend/src/components/marketing/FaqSection.tsx": "FAQ section displaying brand and creator questions using accordion components.",
  "frontend/src/components/marketing/forms/BrandLeadForm.tsx": "Brand lead capture form with validation, state management, and submission via useLeadSubmission.",
  "frontend/src/components/marketing/forms/CreatorLeadForm.tsx": "Creator lead capture form handling validation, field states, and submission through useLeadSubmission.",
  "frontend/src/components/marketing/Hero.tsx": "Hero section with background image, headline, and CTA buttons that smooth‑scroll to sections.",
  "frontend/src/components/marketing/InlineFieldError.tsx": "Component showing field‑level validation errors with an icon.",
  "frontend/src/components/marketing/LeadCapture.tsx": "Renders a tabbed interface allowing users to choose between brand and creator lead forms. Manages active tab state and displays the appropriate form.",
  "frontend/src/components/marketing/ProcessTimelineSection.tsx": "Displays a multi-step process timeline with icons, descriptions, and durations. Includes an additional card outlining required information for applicants.",
  "frontend/src/components/marketing/Sections.tsx": "Aggregates major marketing sections including how-it-works steps for brands and creators and imports additional subsections. Provides structured content blocks with icons and descriptions.",
  "frontend/src/components/marketing/ServicesBreakdownSection.tsx": "Shows detailed service offerings for brands and creators using cards with icons and descriptions. Divides content into two columns for each audience type.",
  "frontend/src/components/marketing/SiteFooter.tsx": "Renders the site footer with navigation shortcuts, contact info, and branding. Includes smooth-scroll behavior for section links.",
  "frontend/src/components/marketing/SiteHeader.tsx": "Implements a sticky header with desktop and mobile navigation, smooth scrolling, and a toggleable mobile menu sheet. Displays brand logo linking to the top of the page.",
  "frontend/src/components/marketing/SocialProofSection.tsx": "Displays testimonial cards and key stats as social proof. Includes quotes, ratings, roles, and summary metrics.",
  "frontend/src/components/marketing/SubmissionFeedback.tsx": "Shows success or error alerts after form submission. Adjusts messaging based on submission state and application type.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, loading stored identities, handling login/logout, and exposing status flags.",
  "frontend/src/hooks/useLeadSubmission.ts": "Hook exposing brand and creator submission methods with loading, success, and error state handling.",
  "frontend/src/index.css": "Tailwind base styles plus custom OKLCH theme variables for light and dark modes.",
  "frontend/src/lib/formOptions.ts": "Static option lists for budget ranges, timelines, platforms, and audience sizes.",
  "frontend/src/lib/validation.ts": "Simple required-field and email-format validation helpers.",
  "frontend/src/main.tsx": "App entry point initializing React, React Query, Internet Identity provider, and global styles.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, fonts, animations, and enabling plugins.",
  "project_state.json": "Defines the project state for the Koda D website, outlining its purpose, architecture notes, features, and requirements. Contains versioning, existing features, and no known issues."
}